{
    "id": "Approach the tree",
    "requirements":
    {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "successAttributes":
    {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "onSuccess":
    {
        "displayText": "At the base of the majestic oak, the very tree that had sheltered him in his infancy, a question began to bubble in {Player}’s mind. How could this clearing be so serene and peaceful, so untouched by the wild chaos of the rest of the forest? Surely, after all these years, there should have been no trace of anything left.\n\nYet, just beneath the small patch of foliage surrounding the tree, a glint of alabaster caught his eye. He knelt and, with careful fingers, plucked a single feather from the earth. Its radiant glow illuminated in his hands, shimmering with an almost unnatural light.\n\nThe feather was impossibly smooth to the touch, the sheen so pure it could only belong to one thing. {Player}’s heart skipped a beat as he recalled the history lessons: the angels. The barbaric, cruel race that once ruled over the land, their wings of destruction now nothing more than a shadow of the past.\n\nThis revelation struck him with full force. Somehow, he was connected to the angels. The realization sent a shiver through his spine. He had always known something was different about him, but this? This was something far more dangerous.\n\nThe questions came rushing in: What did this mean for him? How was he connected to such a cruel and violent race? Was he bound to inherit their legacy of destruction? Would discovering the truth endanger not only him but everyone he loved? Some answers to these questions could be more terrifying than the questions themselves.\n\nThis revelation meant one thing: He was no longer just a prince with questions about his origins. He was now someone who had to decide whether to continue pursuing the dangerous past that awaited him or turn his back on it forever.",
        "modifyAttributes":
        {
            "strength": 0,
            "dexterity": 0,
            "constitution": 0,
            "charisma": 0,
            "magic": 0,
            "karma": 0
        },
        "choices": [
             "Return to the kingdom and let the past be buried",
             "Continue on this now dangerous journey"
            ]
    },
    "onFailure":
    {
        "displayText": "",
        "modifyAttributes":
        {
            "strength": 0,
            "dexterity": 0,
            "constitution": 0,
            "charisma": 0,
            "magic": 0,
            "karma": 0
        },
        "choices": [
            ]
    }
}