{
    "id": "{Player} join the hooded man",
    "requirements": {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "successAttributes": {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "onSuccess": {
        "displayText": "{Player} nodded, swallowing his fear. “I'll follow you,” he said. Instantly, the air seemed to shift around him, charged with the strange energy of his half-Angel nature. The hooded man's smile widened.\n\n“Good. Step carefully the Angels will not forgive weakness.”\n\nThey moved through the forest with astonishing speed, weaving between trees and shadows. {Player} noticed small relics hanging from the man's belt, faintly glowing, each one humming with suppressed power. “These are tools,” the man said. “You will need them. Your abilities are raw, uncontrolled but with guidance, you could become something far greater than even the Angels imagined.”\n\nThey arrived at a hidden clearing where other figures waited, cloaked and armed, watching silently as {Player} approached. “These are my allies,” the man whispered. “Each one has a story, each one fights the Angels in their own way. And now, you fight with us.”\n\nFor the first time, {Player} felt a glimmer of purpose, but it came with a warning the glow from the relic pulsed faster, almost like a heartbeat. He realized this path would demand everything: courage, cunning, and mastery of the power he barely understood.",
        "modifyAttributes": {
            "strength": 0,
            "dexterity": 0,
            "constitution": 0,
            "charisma": 0,
            "magic": 0,
            "karma": 0
        },
        "choices": []
    },
    "onFailure": {
        "displayText": "",
        "modifyAttributes": {
            "strength": 0,
            "dexterity": 0,
            "constitution": 0,
            "charisma": 0,
            "magic": 0,
            "karma": 0
        },
        "choices": []
    }
}