{
    "id": "Continue on this now dangerous journey",
    "requirements": {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "successAttributes": {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "onSuccess": {
        "displayText": "Even if he was connected to the angels, the burning need inside {Player} refused to be extinguished. He had to know the truth. Why had he been placed in that forest? Why had the angels, a race so cruel, abandoned him rather than simply ending his life? Could it be that his original mother was a kind angel, someone different from the rest?\n\nThe questions swirled in his mind like an endless storm, with no answers in sight. Yet the drive to uncover the truth, no matter how dangerous the journey, pushed him forward.\n\n{Player} took a steadying breath, steeling himself for the path ahead. The road would be long and fraught with danger, but the answers, the truth, would be worth the peril. He had a new purpose now: not just to return home, but to find out who he truly was, and why he had been left to survive in a world so different from the one his kind ruled.\n\nAs he looked toward the distant horizon, {Player} made a vow to himself, he would see this journey through to the end, no matter what it took. He could only hope that by the time he returned home, he would be more than just a prince. He would be the one who understood the truth of his past, no matter how dark it might be.",
        "modifyAttributes": {
            "strength": 0,
            "dexterity": 0,
            "constitution": 0,
            "charisma": 0,
            "magic": 0,
            "karma": 0
        },
        "choices": []
    },
    "onFailure": {
        "displayText": "",
        "modifyAttributes": {
            "strength": 0,
            "dexterity": 0,
            "constitution": 0,
            "charisma": 0,
            "magic": 0,
            "karma": 0
        },
        "choices": []
    }
}