{
    "id": "{Player} accepts the truth of his celestial origin and sets forth to embrace his destiny",
    "requirements": {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "successAttributes": {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "onSuccess": {
        "displayText": "The truth settled within {Player} like light filling an empty vessel. He looked to the sky, where the stars shimmered with quiet recognition, as though they had been waiting for this moment. The air around him hummed softly, and he felt the faint trace of wings at his back, unseen but undeniable.\n\nHe closed his eyes, feeling both sorrow and peace. The world he had known — the palace, the laughter, the warmth of {Queen#Name}’s embrace — would always remain in his heart, but he could no longer belong to it fully. The path ahead was vast and uncertain, yet his purpose had finally taken shape.\n\nAs dawn approached, the waters of {Lake} glowed once more, forming a bridge of light that stretched toward the distant horizon. The whisper returned, gentle and proud. *Go forth, child of the stars. The world still remembers what it has forgotten.*\n\nWith one last look toward the kingdom’s distant towers, {Player} stepped onto the glowing path. Each step carried him further from the mortal world and closer to the realm of forgotten light, where his true journey would begin.",
        "modifyAttributes": {
            "strength": 2,
            "dexterity": 2,
            "constitution": 2,
            "charisma": 1,
            "magic": 4,
            "karma": 3
        },
        "choices": []
    },
    "onFailure": {
        "displayText": "",
        "modifyAttributes": {
            "strength": 0,
            "dexterity": 0,
            "constitution": 0,
            "charisma": 0,
            "magic": 0,
            "karma": 0
        },
        "choices": []
    }
}