{
    "id": "Return to the kingdom and let the past be buried",
    "requirements":
    {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "successAttributes":
    {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "onSuccess":
    {
        "displayText": "The weight of the feather in {Player}’s hand felt heavier than ever, its glowing radiance now a stark reminder of everything he had just uncovered. A part of him had wanted to continue, to face whatever truths lay ahead in the deep woods, to unravel the mysteries of his origins. But another part of him — the part that had always known the comfort of the kingdom, the security of the life he had built tugged him in the opposite direction.\n\nWhat if the answers were worse than he feared? What if the truth of the angels meant his own destruction, or worse, the destruction of the people he loved? How could he live with the knowledge that he had been born from such a brutal, unforgiving race?\n\nThe decision weighed on him, the past calling him to unearth its secrets while the future urged him to be the ruler his kingdom needed. Slowly, {Player} closed his hand around the feather, the glow dimming in his palm. His path was clear, even if it wasn’t the one he truly wanted.\n\nThe kingdom needed him. His people needed a prince, a future king who could protect them, who could rule with strength and wisdom. The past would remain buried, locked away like the secrets of his origins, and he would carry on, as though nothing had ever been discovered.\n\nTurning away from the oak tree, {Player} made his way back through the forest, his heart heavy with a sense of unfinished business, but his resolve firm. He could not allow the darkness of the past to define him, not when there was so much more at stake.\n\nThe journey home would be long, but it was the one he knew. And for now, that was enough.",
        "modifyAttributes":
        {
            "strength": 0,
            "dexterity": 0,
            "constitution": 0,
            "charisma": 0,
            "magic": 0,
            "karma": 0
        },
        "choices": [
             "Continue on the path of an heir"
            ]
    },
    "onFailure":
    {
        "displayText": "",
        "modifyAttributes":
        {
            "strength": 0,
            "dexterity": 0,
            "constitution": 0,
            "charisma": 0,
            "magic": 0,
            "karma": 0
        },
        "choices": [
            ]
    }
}