{
    "id": "{Player} stays in the market",
    "requirements":
    {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "successAttributes":
    {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "onSuccess":
    {
        "displayText": "{Player} chose not to give chase, lingering in the comforting noise and glow of the market as merchants packed their stalls and lanterns dimmed. A storyteller's voice rose through the thinning crowd, recounting old tales of Angels and forgotten wars. Something in the story tugged at {Player}'s chest a faint echo of familiarity he couldn't name.\n\nWhen it ended, the market had gone quiet. As {Player} turned to leave, that uneasy feeling of being watched returned. His gaze caught a flicker of movement the same figure from before, eyes glinting in the dark before darting into a narrow alley.\n\nThis time, {Player} didn't hesitate. He ran after the shadow, only to find himself and the figure in a secluded courtyard.\n\nMoonlight spilled weakly across cracked stone, and a chill wind swept through the silence. The stranger turned, lowering their hood a sharp gaze meeting {Player}'s. From beneath their cloak, they drew out a small relic, its surface etched with faint runes that shimmered with an eerie white light.\n\n”It reacts to the presence of Angels” the figure said, holding the relic up as its glow intensified. Their voice dropped, steady but cautious. “And right now, it's reacting to you. So tell me, traveler…” The relic pulsed brighter, reflecting in their eyes. “What are you?”",
        "modifyAttributes":
        {
            "strength": 0,
            "dexterity": 0,
            "constitution": 0,
            "charisma": 0,
            "magic": 0,
            "karma": 0
        },
        "choices": [
             "{Player} explains his circumstances",
             "{Player} hides his circumstances"
            ]
    },
    "onFailure":
    {
        "displayText": "",
        "modifyAttributes":
        {
            "strength": 0,
            "dexterity": 0,
            "constitution": 0,
            "charisma": 0,
            "magic": 0,
            "karma": 0
        },
        "choices": [
            ]
    }
}