{
    "id": "{Player} decides to return to {VillageName} to seek the old woman's counsel",
    "requirements": {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "successAttributes": {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "onSuccess": {
        "displayText": "The whispers faded as {Player} turned away from {Lake}. The still water behind him reflected the stars, silent and unmoving, as he made his way back along the narrow trail toward {VillageName}. The night was deep and the road quiet, but something within him urged him onward. He needed guidance, and only one person might hold answers.\n\nWhen he arrived, the village slept. Only a single light burned within a small cottage near the edge of the fields. He knocked once, and the old woman’s voice called softly for him to enter. The air inside smelled of herbs and woodsmoke. She sat beside a small fire, her wrinkled hands folded calmly on her lap, as though she had been waiting.\n\n“I told you the lake shows what lies beneath,” she said, her eyes clouded yet sharp. “And what did it show you, child of the crown?”\n\n{Player} told her of the voice, the visions in the water, and the pulsing book. The old woman nodded slowly, her gaze distant. She reached for a small, carved talisman and held it out. “Not all truths are ready to be known. Some must be discovered. Others… forgotten. The choice is yours.”\n\nHer voice became softer, almost a whisper itself. “The lake still holds answers. Follow its shoreline, and it may guide you further. Or, you may leave all this behind, and return to the life you know. There is no shame in either path. Wisdom comes not only from knowing, but also from choosing what to carry in your heart.”\n\nShe let the fire crackle for a moment, then looked at him expectantly. “What will you do, {Player}? Will you chase the whisper, or lay it all to rest?”",
        "modifyAttributes": {
            "strength": 0,
            "dexterity": 0,
            "constitution": 1,
            "charisma": 2,
            "magic": 1,
            "karma": 1
        },
        "choices": [
            "{Player} follows the lake's shoreline, searching for the source of the voice",
            "{Player} forgets the visions and returns to {Kingdom#Name} to live as a prince"
        ]
    },
    "onFailure": {
        "displayText": "",
        "modifyAttributes": {
            "strength": 0,
            "dexterity": 0,
            "constitution": 0,
            "charisma": 0,
            "magic": 0,
            "karma": 0
        },
        "choices": []
    }
}
