{
    "id": "{Player} sets out on a journey to find out more about himself",
    "requirements": {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "successAttributes": {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "onSuccess": {
        "displayText": "The following morning, the palace felt unusually still. The Festival of Wings had ended, and the air carried the faint scent of burned lantern oil and fading laughter. Yet within {Player}, something had changed. The whisper from the library lingered in his thoughts, both a promise and a warning.\n\nHe knew he could not stay. There were no answers within these golden walls. As the first rays of dawn touched the spires of {Kingdom#Name}, {Player} packed a small satchel containing a cloak, provisions, and the mysterious black book that now seemed to hum faintly when he touched it. His heart pounded with both fear and anticipation. Beyond the palace gates lay the true world, vast and untamed.\n\nThe road leading out of the capital curved through golden fields before fading into the shadow of the {Forest1}, a place whispered to be older than men, where spirits still lingered among the ancient stones. The guards hesitated to let him leave, but something in his eyes silenced their questions. He was no longer the boy who had grown up among silks and courtly lessons.\n\nAs he crossed the final gate, the whisper returned, soft and guiding. It spoke within his mind: *Your path begins where the stars fall.* The words stirred something deep inside him. The Festival of Wings celebrated the night when the stars had once fallen upon the world, bringing both blessings and curses. Perhaps the truth of his birth lay somewhere among those fallen lights.\n\nBy dusk, {Player} reached a crossroads. To the east, the shimmering waters of {Lake} glowed beneath the rising moon, said to reflect truths unseen by mortal eyes. To the west, a narrow mountain trail led toward {Mountain}, where travelers spoke of a hermit who still remembered the language of angels.\n\n{Player} felt the wind shift as if the world itself waited for his choice.",
        "modifyAttributes": {
            "strength": 1,
            "dexterity": 1,
            "constitution": 1,
            "charisma": 0,
            "magic": 2,
            "karma": 0
        },
        "choices": [
            "{Player} travels east toward {Lake}",
            "{Player} ventures west toward {Mountain}"
        ]
    },
    "onFailure": {
        "displayText": "",
        "modifyAttributes": {
            "strength": 0,
            "dexterity": 0,
            "constitution": 0,
            "charisma": 0,
            "magic": 0,
            "karma": 0
        },
        "choices": []
    }
}