{
  "id": "{Player} hides his circumstances",
  "requirements": {
    "strength": 0,
    "dexterity": 0,
    "constitution": 0,
    "charisma": 0,
    "magic": 0,
    "karma": 0
  },
  "successAttributes": {
    "strength": 0,
    "dexterity": 0,
    "constitution": 0,
    "charisma": 0,
    "magic": 0,
    "karma": 0
  },
  "onSuccess": {
    "displayText": "{Player} hesitated, heart hammering in his chest. He clenched his fists and forced a calm tone. “I am nothing,” he said. “Just a wanderer passing through your city. I have no connection to Angels or any of their business.”\n\nThe stranger's eyes narrowed, and the relic flared violently, pulsing in rhythm with {Player}'s fear. “A lie,” the figure said quietly, almost to himself. “You cannot hide what you are.” The light from the relic grew blinding, bathing the courtyard in a harsh white glow that made {Player} stumble backward.\n\nShadows stretched unnaturally as more figures emerged from the alleys, drawn by the relic's power. They encircled him silently, weapons glinting in the moonlight. {Player} tried to flee, but the pulse of the relic seemed to bind his movements, each step slower than the last.\n\nThe first strike was swift a dagger, its edge shimmering with the same eerie light, pierced his shoulder. Pain erupted through his body, and he fell to his knees, clutching at the wound. The stranger's voice echoed over him, cold and unyielding: “Truth cannot be hidden from the light.”\n\nAs {Player} collapsed fully, the glow of the relic dimmed, leaving only the faintest trace of its power a warning to any who might dare conceal what they truly are. The courtyard fell silent again, the market sounds far away, as one more life was claimed by the unrelenting eyes of those who hunted Angels.",
    "modifyAttributes": {
      "strength": 0,
      "dexterity": 0,
      "constitution": 0,
      "charisma": 0,
      "magic": 0,
      "karma": 0
    },
    "choices": [
    ]
  },
  "onFailure": {
    "displayText": "",
    "modifyAttributes": {
      "strength": 0,
      "dexterity": 0,
      "constitution": 0,
      "charisma": 0,
      "magic": 0,
      "karma": 0
    },
    "choices": [
    ]
  }
}