{
  "id": "{Player} talks about what happened last night",
  "requirements": {
    "strength": 0,
    "dexterity": 0,
    "constitution": 0,
    "charisma": 0,
    "magic": 0,
    "karma": 0
  },
  "successAttributes": {
    "strength": 0,
    "dexterity": 0,
    "constitution": 0,
    "charisma": 1,
    "magic": 0,
    "karma": 0
  },
  "onSuccess": {
    "displayText": "{Player} hesitated, then spoke honestly. “I… I don't fully know what I am. I was born different, not quite human. There's something inside me, a power I can't control, but it reacts to Angels, and I fear what it might do.”\n\nThe hooded man's eyes narrowed, a spark of interest flashing across his face. He stepped closer, the faint glow of a relic at his side shimmering as if sensing {Player}'s presence. “Power tied to the Angels… and you do not belong to them,” he murmured, voice low and calculating. “Fascinating. Perhaps you can be of use to me.”\n\nHe drew the relic fully into view, its strange light reflecting in his eyes. “I fight against the Angels, against their dominion and tyranny. With your… abilities, we could strike where no one else can. You could help turn their own power against them.”\n\n{Player} felt a mixture of caution and curiosity. The man's offer was dangerous, but the pull of purpose stirred within him. “Come,” the hooded figure said quietly. “You have a choice. Walk away, or step into a path that could change everything”.",
    "modifyAttributes": {
      "strength": 0,
      "dexterity": 0,
      "constitution": 0,
      "charisma": 0,
      "magic": 0,
      "karma": 0
    },
    "choices": [
      "{Player} join the hooded man",
      "{Player} refuse and flee"
    ]
  },
  "onFailure": {
    "displayText": "“If what you say is true,” the man murmured, “then your existence is a threat to us all.”\\n\\nBefore {Player} could react, the sword pierced his chest. The forest around him blurred as the strength drained from his body. The hooded man withdrew the blade, whispering a short prayer before turning away.\\n\\nAs {Player} fell to his knees, vision fading, the last thing he saw was a flicker of white light drifting upward through the canopy silent, and vanishing into the sky.\\n\\Then, there was nothing.",
    "modifyAttributes": {
      "strength": 0,
      "dexterity": 0,
      "constitution": 0,
      "charisma": 0,
      "magic": 0,
      "karma": 0
    },
    "choices": [
    ]
  }
}