{
    "id": "{Player} decides to head to the nearest town",
    "requirements":
    {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "successAttributes":
    {
        "strength": 0,
        "dexterity": 0,
        "constitution": 0,
        "charisma": 0,
        "magic": 0,
        "karma": 0
    },
    "onSuccess":
    {
        "displayText": "{Player} followed the winding paths through the woods, moving steadily toward the town of {TownName}. The forest stretched around him, silent in some places, alive in others, as sunlight pierced through the leaves in shifting patterns. He passed signs of recent travelers: a discarded cloak, a worn bootprint, a cart rut pressed into the soft earth.\n\nEmerging from the woods, he found a road that led directly to the town, and he noticed traders walking along, carrying goods from distant places. Travelers passed in both directions, sharing brief stories and greetings as they moved. The hum of activity grew stronger with every step, blending voices, the creak of wheels, and the occasional shout. As he reached the town gates, {Player} was met with a bustling scene. Merchants were calling out their wares, children darted between stalls, and carts rattled over cobblestones. People moved with purpose, stopping only to exchange coins, laughter, or a quick word. The scent of fresh bread mixed with the sharp tang of spices, creating an unmistakable essence of daily life. {Player} paused for a moment, taking in the rhythm of the town, before stepping fully into its heart, ready to continue his journey.",
        "modifyAttributes":
        {
            "strength": 0,
            "dexterity": 0,
            "constitution": 0,
            "charisma": 0,
            "magic": 0,
            "karma": 0
        },
        "choices": [
            "{Player} joins the Adventurer’s Guild",
            "{Player} joins the Town’s Security Force"
            ]
    },
    "onFailure":
    {
        "displayText": "",
        "modifyAttributes":
        {
            "strength": 0,
            "dexterity": 0,
            "constitution": 0,
            "charisma": 0,
            "magic": 0,
            "karma": 0
        },
        "choices": [
            ]
    }
}